In [1]:
import numpy as np
import pandas as pd

In [4]:
s = pd.Series([120, 100, 90, 80], index = [['서울', '서울', '부산', '부산'], ['강남점', '강북점', '해운대점', '서면점']])
s

서울  강남점     120
    강북점     100
부산  해운대점     90
    서면점      80
dtype: int64

In [8]:
print(s['서울'].sum())
s['서울']

220

강남점    120
강북점    100
dtype: int64

In [7]:
s.loc[('부산', '해운대점')]

np.int64(90)

In [9]:
s = pd.Series([300, 250, 500, 400], index = [['전자제품', '전자제품', '식품', '식품'],['노트북', '휴대폰', '라면', '과자']])
s

전자제품  노트북    300
      휴대폰    250
식품    라면     500
      과자     400
dtype: int64

In [10]:
print(s['전자제품'].sum())
s['전자제품']

550

노트북    300
휴대폰    250
dtype: int64

In [11]:
s.loc[('식품', '라면')]

np.int64(500)

In [12]:
s = pd.Series([40, 35, 50, 45], index = [['1학년', '1학년', '2학년', '2학년'],['국어', '수학', '국어', '수학']])
s

1학년  국어    40
     수학    35
2학년  국어    50
     수학    45
dtype: int64

In [13]:
print(s['1학년'].sum())
s['1학년']

75

국어    40
수학    35
dtype: int64

In [14]:
s.loc[('2학년', '수학')]

np.int64(45)

In [22]:
df = pd.DataFrame([[120, 45], [95, 60], [150, 70], [110, 55]],
                  index = [['중앙도서관', '중앙도서관', '시립도서관', '시립도서관'],
                           ['1월', '2월', '1월', '2월']],
                  columns = ['소설', '과학'])
df

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [23]:
df.loc['중앙도서관']

     소설  과학
1월  120  45
2월   95  60

In [24]:
df.loc[('시립도서관', '2월'), '과학']

np.int64(55)

In [25]:
df = pd.DataFrame([[320, 280], [210, 230], [400, 390], [180, 200]],
                  index = [['2022년', '2022년', '2023년', '2023년'],
                           ['SUV', '세단', 'SUV', '세단']],
                  columns = ['1분기', '2분기'])
df

           1분기  2분기
2022년 SUV  320  280
      세단   210  230
2023년 SUV  400  390
      세단   180  200

In [26]:
df.loc['2022년']

     1분기  2분기
SUV  320  280
세단   210  230

In [27]:
df.loc[('2023년', '세단'), '2분기']

np.int64(200)

In [28]:
df = pd.DataFrame([[45, 30], [50, 35], [60, 40], [55, 38]],
                  index = [['서울지점', '서울지점', '부산지점', '부산지점'],
                           ['7월', '8월', '7월', '8월']],
                  columns = ['싱글룸', '더블룸'])
df

         싱글룸  더블룸
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [29]:
df.loc['서울지점']

    싱글룸  더블룸
7월   45   30
8월   50   35

In [30]:
df.loc[('서울지점', '8월'), '더블룸']

np.int64(35)

In [31]:
df = pd.DataFrame([[120, 140], [80, 95], [200, 220], [150, 160]],
                  index = [['가전', '가전', '식품', '식품'],
                           ['노트북', '청소기', '라면', '과자']],
                  columns = ['1월', '2월'])
df

         1월   2월
가전 노트북  120  140
   청소기   80   95
식품 라면   200  220
   과자   150  160

In [32]:
df.loc['가전']

      1월   2월
노트북  120  140
청소기   80   95

In [33]:
df.loc[('식품', '라면'), '2월']

np.int64(220)

In [34]:
df1 = pd.DataFrame([[101, '철수'], [102, '영희'], [103, '민수']], columns = ['고객ID', '이름'])
df1

   고객ID  이름
0   101  철수
1   102  영희
2   103  민수

In [35]:
df2 = pd.DataFrame([[101, '노트북'], [104, '청소기'], [102, '책']], columns = ['고객ID', '상품'])
df2

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [36]:
pd.merge(df1, df2, on = '고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [37]:
df1 = pd.DataFrame([[1, '홍길동'], [2, '임꺽정'], [3, '이몽룡']], columns = ['사번', '이름'])
df2 = pd.DataFrame([[1, '영업'], [3, '개발']], columns = ['사번', '부서'])

In [39]:
pd.merge(df1, df2, on = '사번', how = 'left')

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

In [42]:
df1 = pd.DataFrame([['A1', '노트북'], ['A2', '청소기'], ['A3', '책상']], columns = ['상품코드', '상품명'])
df2 = pd.DataFrame([['A2', 5], ['A3', 8], ['A4', 10]], columns = ['상품코드', '재고'])

In [44]:
pd.merge(df1, df2, on = '상품코드', how = 'right')

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

In [45]:
df1 = pd.DataFrame([[1, '지훈'], [2, '서연'], [3, '민지']], columns = ['학번', '이름'])
df2 = pd.DataFrame([[2, '축구부'], [4, '합창단']], columns = ['학번', '동아리'])

In [47]:
pd.merge(df1, df2, on = '학번', how = 'outer')

   학번   이름  동아리
0   1   지훈  NaN
1   2   서연  축구부
2   3   민지  NaN
3   4  NaN  합창단

In [54]:
df1 = pd.DataFrame([[1, '홍길동'], [2, '임꺽정']], columns = ['사번', '이름'])
df2 = pd.DataFrame([['영업'], ['개발']], columns = ['부서'])
pd.concat([df1, df2], axis = 1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [57]:
df1 = pd.DataFrame([100, 200], columns = ['매출'])
df2 = pd.DataFrame([150, 250], columns = ['매출'])
df3 = pd.DataFrame([300, 400], columns = ['매출'])
pd.concat([df1, df2, df3], ignore_index = True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [59]:
df1 = pd.DataFrame([['철수', 85], ['영희', 90]], columns = ['이름', '국어'])
df2 = pd.DataFrame([['민수', 78], ['지연', 92]], columns = ['이름', '수학'])
pd.concat([df1, df2], axis = 1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92

In [65]:
df = pd.DataFrame([['식품', '1월', 200], ['식품', '2월', 250], ['가전', '1월', 500], ['가전','2월', 550]],
                                        columns = ['카테고리', '월', '매출'])
df

  카테고리   월   매출
0   식품  1월  200
1   식품  2월  250
2   가전  1월  500
3   가전  2월  550

In [66]:
df.pivot(index = '카테고리', columns = '월', values = '매출')

월      1월   2월
카테고리
가전    500  550
식품    200  250

In [67]:
df = pd.DataFrame([['중앙', '소설', 120], ['중앙', '과학', 45], ['시립', '소설', 95], ['시립','과학', 60]],
                                        columns = ['도서관', '장르', '대출건수'])
df

  도서관  장르  대출건수
0  중앙  소설   120
1  중앙  과학    45
2  시립  소설    95
3  시립  과학    60

In [68]:
df.pivot(index = '도서관', columns = '장르', values = '대출건수')

장르   과학   소설
도서관
시립   60   95
중앙   45  120

In [69]:
df = pd.DataFrame([['서울', '싱글룸', 45], ['서울', '더블룸', 30], ['부산', '싱글룸', 50], ['부산','더블룸', 35]],
                                        columns = ['지점', '객실유형', '예약건수'])
df

   지점 객실유형  예약건수
0  서울  싱글룸    45
1  서울  더블룸    30
2  부산  싱글룸    50
3  부산  더블룸    35

In [71]:
df.pivot(index = '지점', columns = '객실유형', values = '예약건수')

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45